//Дано не настина покрай предишната задача, но поне "научих" синтаксиса.
//На един ред, но поне малко разделени?
//Имаме и NaN, не зная дали е нарочно :)
public class Zadacha4 {
    public static void main(String[] args) {
        System.out.print(Math.sqrt(8)+" | "+Math.sqrt(353)+" | "+Math.sqrt(78)+" | "+Math.sqrt(3)+" | |"+Math.sqrt(-67)+" | "+Math.sqrt(723)+" | "+Math.sqrt(2000)+" | "+Math.sqrt(-100));
    }
}
